{
    "php": [
        {
            "name": "Joomla",
            "description": "Joomla is an award-winning content management system (CMS), which enables you to build Web sites and powerful online applications. Many aspects, including its ease-of-use and extensibility, have made Joomla the most popular Web site software available. Best of all, Joomla is an open source solution that is freely available to everyone. ",
            "directory": "joomla",
            "files": [
                "Joomla_3.4.3-Stable-Full_Package.zip"
            ]
        },
        {
            "name": "WordPress",
            "description": "WordPress is web software you can use to create a beautiful website or blog. We like to say that WordPress is both free and priceless at the same time. The core software is built by hundreds of community volunteers, and when you're ready for more there are thousands of plugins and themes available to transform your site into almost anything you can imagine. Over 60 million people have chosen WordPress to power the place on the web they call \"home\" we'd love you to join the family.",
            "directory": "wordpress",
            "files": [
                "wordpress-4.2.2.zip"
            ]
        },
        {
            "name": "Drupal",
            "description": "Drupal is an open-source platform and content management system for building dynamic web sites offering a broad range of features and services including user administration, publishing workflow, discussion capabilities, news aggregation, metadata functionalities using controlled vocabularies and XML publishing for content sharing purposes. Equipped with a powerful blend of features and configurability, Drupal can support a diverse range of web projects ranging from personal weblogs to large community-driven sites.",
            "directory": "drupal",
            "files": [
                "drupal-7.38.zip"
            ]
        },
        {
            "name": "bbPress",
            "description": "bbPress is forum software with a twist from the creators of WordPress. bbPress is plain and simple forum software, plain and simple. It’s easy to use, easy to administrate, fast and clean. But don’t let its simplicity deceive you; underneath the gleam, it’s got some powerful features and is highly customizable",
            "directory": "bbpress",
            "files": [
                "bbpress.2.5.7.zip"
            ]
        },
        {
            "name": "CodeIgniter",
            "description": "CodeIgniter is a powerful PHP framework with a very small footprint, built for PHP coders who need a simple and elegant toolkit to create full-featured web applications. If you're a developer who lives in the real world of shared hosting accounts and clients with deadlines, and if you're tired of ponderously large and thoroughly undocumented frameworks",
            "directory": "codeigniter",
            "files": [
                "CodeIgniter-3.0.0.zip"
            ]
        },
        {
            "name": "Slim Framework",
            "description": "Slim is a PHP micro framework that helps you quickly write simple yet powerful web applications and APIs. Slim is easy to use for both beginners and professionals. Slim favors cleanliness over terseness and common cases over edge cases. Its interface is simple, intuitive, and extensively documented — both online and in the code itself. Thank you for choosing the Slim Framework for your next project. I think you're going to love it.",
            "directory": "slim",
            "files": [
                "Slim-2.6.2.zip"
            ]
        },
        {
            "name": "phpMyAdmin",
            "description": "phpMyAdmin is a free software tool written in PHP, intended to handle the administration of MySQL over the Web. phpMyAdmin supports a wide range of operations on MySQL, MariaDB and Drizzle. Frequently used operations (managing databases, tables, columns, relations, indexes, users, permissions, etc) can be performed via the user interface, while you still have the ability to directly execute any SQL statement.",
            "directory": "phpmyadmin",
            "files": [
                "phpMyAdmin-4.4.11-all-languages.zip"
            ]
        }
    ],
    "javascript": [
        {
            "name": "jQuery",
            "description": "jQuery is a new kind of JavaScript Library. jQuery is a fast and concise JavaScript Library that simplifies HTML document traversing, event handling, animating, and Ajax interactions for rapid web development. jQuery is designed to change the way that you write JavaScript.",
            "directory": "jquery",
            "files": [
                "jquery-1.11.3.js",
                "jquery-1.11.3.min.js",
                "jquery-1.11.3.min.map"
            ]
        },
        {
            "name": "Angular.js",
            "description": "AngularJS HTML enhanced for web apps! AngularJS is a structural framework for dynamic web apps. It lets you use HTML as your template language and lets you extend HTML's syntax to express your application's components clearly and succinctly. Out of the box, it eliminates much of the code you currently write through data binding and dependency injection. And it all happens in JavaScript within the browser, making it an ideal partner with any server technology.",
            "directory": "angular.js",
            "files": [
                "angular.js",
                "jangular.min.js",
                "angular.min.js.map",
                "angular-1.4.3.zip",
                "angular-animate.js",
                "angular-animate.min.js",
                "angular-animate.min.js.map",
                "angular-aria.js",
                "angular-aria.min.js",
                "angular-aria.min.js.map",
                "angular-cookies.js",
                "angular-cookies.min.js",
                "angular-cookies.min.js.map",
                "angular-csp.css",
                "angular-loader.js",
                "angular-loader.min.js",
                "angular-loader.min.js.map",
                "angular-message-format.js",
                "angular-message-format.min.js",
                "angular-message-format.min.js.map",
                "angular-messages.js",
                "angular-messages.min.js",
                "angular-messages.min.js.map",
                "angular-mocks.js",
                "angular-resource.js",
                "angular-resource.min.js",
                "angular-resource.min.js.map",
                "angular-route.js",
                "angular-route.min.js",
                "angular-route.min.js.map",
                "angular-sanitize.js",
                "angular-sanitize.min.js",
                "angular-sanitize.min.js.map",
                "angular-scenario.js",
                "angular-touch.js",
                "angular-touch.min.js",
                "angular-touch.min.js.map"
            ]
        }
    ],
    "software": [],
    "others": []
}
